# Tarea 1

In [1]:
import pandas as pd

salaries_df = pd.read_csv('Salaries.csv')
salaries_df = salaries_df.drop(columns=['Unnamed: 0'])
salaries_df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [2]:
salaries_df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [6]:
not_usd_salaries_df = salaries_df[salaries_df['salary_currency'] != 'USD'].reset_index(drop=True)
not_usd_salaries_df['convertion_rate'] = not_usd_salaries_df['salary_in_usd']/not_usd_salaries_df['salary']
convertion_rate_df = not_usd_salaries_df.groupby(['salary_currency', 'work_year'])['convertion_rate'].mean()
convertion_rate_df

salary_currency  work_year
AUD              2022         0.722523
BRL              2021         0.185361
CAD              2020         0.745885
                 2021         0.797622
                 2022         0.787911
CHF              2022         1.063878
CLP              2021         0.001317
CNY              2020         0.144920
                 2022         0.155150
DKK              2020         0.152987
                 2021         0.158939
EUR              2020         1.140463
                 2021         1.182046
                 2022         1.099143
GBP              2020         1.282635
                 2021         1.375462
                 2022         1.308769
HUF              2020         0.003249
                 2021         0.003296
INR              2020         0.013493
                 2021         0.013523
                 2022         0.013173
JPY              2020         0.009368
                 2021         0.009102
MXN              2020         0.046543
                 2021         0.049293
PLN              2021         0.258872
                 2022         0.237267
SGD              2021         0.744118
TRY              2021         0.112063
Name: convertion_rate, dtype: float64

In [5]:
average_salary_company_location = salaries_df.groupby(['company_location'])['salary_in_usd'].mean().reset_index().sort_values(by='salary_in_usd', ascending=False)
average_salary_company_location

   company_location  salary_in_usd
43               RU  157500.000000
48               US  144055.261972
38               NZ  125000.000000
24               IL  119059.000000
29               JP  114127.333333
3                AU  108042.666667
0                AE  100000.000000
14               DZ  100000.000000
26               IQ  100000.000000
6                CA   99823.733333
44               SG   89294.000000
4                BE   85699.000000
12               DE   81887.214286
18               GB   81583.042553
2                AT   72920.750000
9                CN   71665.500000
23               IE   71444.000000
40               PL   66082.500000
7                CH   64114.000000
17               FR   63970.666667
45               SI   63831.000000
42               RO   60000.000000
37               NL   54945.750000
13               DK   54386.333333
16               ES   53060.142857
19               GR   52293.090909
11               CZ   50937.000000
41               PT   47793.750000
21               HR   45618.000000
31               LU   43942.666667
8                CL   40038.000000
35               MY   40000.000000
28               IT   36366.500000
22               HU   35735.000000
15               EE   32974.000000
34               MX   32123.333333
36               NG   30000.000000
25               IN   28581.750000
33               MT   28369.000000
10               CO   21844.000000
46               TR   20096.666667
20               HN   20000.000000
5                BR   18602.666667
1                AS   18053.000000
32               MD   18000.000000
47               UA   13400.000000
39               PK   13333.333333
30               KE    9272.000000
27               IR    4000.000000
49               VN    4000.000000

In [10]:
df = pd.DataFrame(salaries_df.employment_type.value_counts()).reset_index(inplace=False)
#df.columns = ['employment_type', 'count']
df

  employment_type  count
0              FT    588
1              PT     10
2              CT      5
3              FL      4

In [23]:
df = pd.DataFrame(salaries_df.company_location.value_counts()).reset_index(inplace=False)

threshold = 10 

other_count = df[df['count'] < threshold]['count'].sum()

other_row = {'company_location': 'OTHER', 'count': other_count}
filtered_list = df[df['count'] >= threshold].to_dict('records')
filtered_list.append(other_row)
other_df = pd.DataFrame(filtered_list)
other_df

  company_location  count
0               US    355
1               GB     47
2               CA     30
3               DE     28
4               IN     24
5               FR     15
6               ES     14
7               GR     11
8            OTHER     83

In [44]:
# how many entries are in the US
us_salaries = salaries_df[salaries_df['employee_residence'] == 'US']
us_salaries.shape[0]

332

In [ ]:
salaries_df.info()

In [ ]:
dff = salaries_df[(salaries_df["experience_level"] == 'SE') & (salaries_df["job_title"] == 'Data Scientist')]
dff

In [37]:
ex_level = 'EN'

mi_df = salaries_df[salaries_df["experience_level"] == ex_level] 
average_salary_per_job_title = mi_df.groupby(['work_year', 'job_title'])['salary_in_usd'].mean().reset_index()
average_salary_per_job_title

    work_year                           job_title  salary_in_usd
0        2020                        AI Scientist   45896.000000
1        2020                   Big Data Engineer   70000.000000
2        2020               Business Data Analyst  100000.000000
3        2020                        Data Analyst   44768.000000
4        2020                       Data Engineer   48215.500000
5        2020             Data Science Consultant    5707.000000
6        2020                      Data Scientist   54983.333333
7        2020                         ML Engineer   15966.000000
8        2020           Machine Learning Engineer  194000.000000
9        2020                  Research Scientist   42000.000000
10       2021                        AI Scientist   14017.666667
11       2021              Applied Data Scientist  110037.000000
12       2021                     BI Data Analyst   32136.000000
13       2021                   Big Data Engineer   11055.000000
14       2021               Business Data Analyst   59102.000000
15       2021            Computer Vision Engineer   28609.000000
16       2021   Computer Vision Software Engineer   70000.000000
17       2021                        Data Analyst   58242.666667
18       2021                       Data Engineer   53915.600000
19       2021             Data Science Consultant   76874.250000
20       2021                      Data Scientist   53621.727273
21       2021          Machine Learning Developer  100000.000000
22       2021           Machine Learning Engineer   59611.166667
23       2021          Machine Learning Scientist  225000.000000
24       2021                  Research Scientist   91264.000000
25       2022  Applied Machine Learning Scientist   31875.000000
26       2022            Computer Vision Engineer   67500.000000
27       2022   Computer Vision Software Engineer  150000.000000
28       2022                        Data Analyst   59500.000000
29       2022             Data Analytics Engineer   20000.000000
30       2022                       Data Engineer   68238.600000
31       2022                      Data Scientist   59508.200000
32       2022              Financial Data Analyst  100000.000000
33       2022                         ML Engineer   21983.000000
34       2022           Machine Learning Engineer   37300.000000
35       2022                  Research Scientist  120000.000000